Slybald/Musopti/embedded/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

# Musopti: simulated peripherals for building without the board
CONFIG_MUSOPTI_IMU_SIMULATED=y
CONFIG_MUSOPTI_AUDIO_SIMULATED=y
CONFIG_MUSOPTI_DISPLAY_SIMULATED=y

# BLE (NimBLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
